/*
Задача №3: Создание и запуск простой программыЗадание
Перенесите скрипт в ваш файл программы и запустите созданную программу

public class HelloWorld {
    public static void main(String[] args) {
        System.out.println("Hello, world!");
    }
}
В ответе укажите текст, который получился в результате запуска.
 */

public class HomeWork3 {
    public static void main(String[] args) {
        System.out.println("Hello, world!");
    }
}
